package org.example;

public class RowWeights{
    public static int[] getTotalWeight(int[] weights) {
        int[] result = new int[2];
        for (int i = 0; i < weights.length; i++) {
            if (i % 2 == 0) {
                result[0] += weights[i];
            } else {
                result[1] += weights[i];
            }
        }
        return result;
        // write code here
    }
}

//    Кілька людей стоять в ряд, розділившись на дві команди. Перша людина потрапляє в команду 1, друга - в команду 2, третя - в команду 1 і так далі.
//
//        Реалізуй метод getTotalWeight(), який приймає масив цілих додатних чисел weights (вага людей).
//
//        Поверни новий масив з двох цілих чисел, де перше - загальна вага команди 1, а друге - загальна вага команди 2.
//
//        Примітки:
//
//        масив weights складається щонайменше з одного числа
//        всі числа додатні
//        Приклади:
//
//        {80} // повертає {80, 0}
//        {50, 60, 70, 80} // повертає {120, 140}
//        {70, 58, 75, 34, 91} // повертає {236, 92}
